mapkeeper/ycsb/data/thrift2/hsha_5000
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.MapKeeperClient -P workloads/workloada -p mapkeeper.host=dqa-config2-006.dht.bf1.yahoo.com -p mapkeeper.port=9090 -s -threads 5000 -load
Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
 0 sec: 0 operations; 
Maximum execution time specified as: 60 secs
 10 sec: 607347 operations; 60571.16 current ops/sec; [INSERT AverageLatency(us)=23020.4] 
 20 sec: 1215529 operations; 60769.58 current ops/sec; [INSERT AverageLatency(us)=34617.3] 
 30 sec: 1799825 operations; 58406.24 current ops/sec; [INSERT AverageLatency(us)=39924.68] 
 40 sec: 2375934 operations; 57587.86 current ops/sec; [INSERT AverageLatency(us)=41772.99] 
 50 sec: 2929865 operations; 55370.95 current ops/sec; [INSERT AverageLatency(us)=44349.19] 
 60 sec: 3444842 operations; 51482.26 current ops/sec; [INSERT AverageLatency(us)=51328.41] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
Still waiting for thread Thread-1385 to complete. Workload status: true
Still waiting for thread Thread-1385 to complete. Workload status: true
Still waiting for thread Thread-1385 to complete. Workload status: true
 70 sec: 3594279 operations; 14934.74 current ops/sec; [INSERT AverageLatency(us)=50256.24] 
Still waiting for thread Thread-1385 to complete. Workload status: true
Still waiting for thread Thread-1385 to complete. Workload status: true
Still waiting for thread Thread-1385 to complete. Workload status: true
[...]
 80 sec: 3594279 operations; 0 current ops/sec;  
Still waiting for thread Thread-1385 to complete. Workload status: true
Still waiting for thread Thread-1385 to complete. Workload status: true
Still waiting for thread Thread-1385 to complete. Workload status: true
[...]
 90 sec: 3594279 operations; 0 current ops/sec;  
Still waiting for thread Thread-1385 to complete. Workload status: true
Still waiting for thread Thread-1385 to complete. Workload status: true
 95 sec: 3594279 operations; 0 current ops/sec;  
[OVERALL], RunTime(ms), 95861.0
[OVERALL], Throughput(ops/sec), 37494.695444445606
[INSERT], Operations, 3594279
[INSERT], AverageLatency(us), 39210.28425728776
[INSERT], MinLatency(us), 243
[INSERT], MaxLatency(us), 7491537
[INSERT], 95thPercentileLatency(ms), 52
[INSERT], 99thPercentileLatency(ms), 55
[INSERT], Return=0, 3594279
[INSERT], 0, 1203
[INSERT], 1, 2561
[INSERT], 2, 3400
[INSERT], 3, 2569
[INSERT], 4, 2300
[INSERT], 5, 1998
[INSERT], 6, 1881
[INSERT], 7, 1665
[INSERT], 8, 1102
[INSERT], 9, 1225
[INSERT], 10, 1673
[INSERT], 11, 4113
[INSERT], 12, 7613
[INSERT], 13, 11426
[INSERT], 14, 22966
[INSERT], 15, 25870
[INSERT], 16, 31618
[INSERT], 17, 40362
[INSERT], 18, 27554
[INSERT], 19, 21561
[INSERT], 20, 27308
[INSERT], 21, 36183
[INSERT], 22, 22805
[INSERT], 23, 46299
[INSERT], 24, 51040
[INSERT], 25, 86397
[INSERT], 26, 84687
[INSERT], 27, 22801
[INSERT], 28, 25376
[INSERT], 29, 39490
[INSERT], 30, 45642
[INSERT], 31, 48678
[INSERT], 32, 39844
[INSERT], 33, 75458
[INSERT], 34, 196206
[INSERT], 35, 163354
[INSERT], 36, 123964
[INSERT], 37, 144194
[INSERT], 38, 122502
[INSERT], 39, 135592
[INSERT], 40, 356693
[INSERT], 41, 267033
[INSERT], 42, 106155
[INSERT], 43, 102729
[INSERT], 44, 68918
[INSERT], 45, 54416
[INSERT], 46, 45628
[INSERT], 47, 54509
[INSERT], 48, 119166
[INSERT], 49, 180445
[INSERT], 50, 165159
[INSERT], 51, 123005
[INSERT], 52, 86453
[INSERT], 53, 44879
[INSERT], 54, 20470
[INSERT], 55, 18794
[INSERT], 56, 8386
[INSERT], 57, 3925
[INSERT], 58, 2003
[INSERT], 59, 2817
[INSERT], 60, 420
[INSERT], 61, 470
[INSERT], 62, 364
[INSERT], 63, 324
[INSERT], 64, 258
[INSERT], 65, 396
[INSERT], 66, 204
[INSERT], 67, 163
[INSERT], 68, 134
[INSERT], 69, 134
[INSERT], 70, 207
[INSERT], 71, 141
[INSERT], 72, 126
[INSERT], 73, 146
[INSERT], 74, 162
[INSERT], 75, 206
[INSERT], 76, 185
[INSERT], 77, 125
[INSERT], 78, 220
[INSERT], 79, 134
[INSERT], 80, 128
[INSERT], 81, 115
[INSERT], 82, 116
[INSERT], 83, 65
[INSERT], 84, 24
[INSERT], 85, 15
[INSERT], 86, 4
[INSERT], 87, 1
[INSERT], 88, 2
[INSERT], 89, 41
[INSERT], 90, 57
[INSERT], 91, 92
[INSERT], 92, 41
[INSERT], 93, 65
[INSERT], 94, 96
[INSERT], 95, 80
[INSERT], 96, 17
[INSERT], 97, 22
[INSERT], 98, 32
[INSERT], 99, 47
[INSERT], 100, 39
[INSERT], 101, 17
[INSERT], 102, 15
[INSERT], 103, 12
[INSERT], 104, 10
[INSERT], 105, 27
[INSERT], 106, 46
[INSERT], 107, 29
[INSERT], 108, 13
[INSERT], 109, 9
[INSERT], 110, 46
[INSERT], 111, 58
[INSERT], 112, 54
[INSERT], 113, 51
[INSERT], 114, 73
[INSERT], 115, 53
[INSERT], 116, 765
[INSERT], 117, 1624
[INSERT], 118, 3
[INSERT], 119, 2
[INSERT], 120, 2
[INSERT], 121, 1
[INSERT], 122, 1
[INSERT], 123, 0
[INSERT], 124, 3
[INSERT], 125, 1
[INSERT], 126, 1
[INSERT], 127, 3
[INSERT], 128, 4
[INSERT], 129, 0
[INSERT], 130, 1
[INSERT], 131, 0
[INSERT], 132, 1
[INSERT], 133, 1
[INSERT], 134, 1
[INSERT], 135, 2
[INSERT], 136, 1
[INSERT], 137, 0
[INSERT], 138, 15
[INSERT], 139, 1
[INSERT], 140, 2
[INSERT], 141, 1
[INSERT], 142, 0
[INSERT], 143, 3
[INSERT], 144, 0
[INSERT], 145, 2
[INSERT], 146, 2
[INSERT], 147, 0
[INSERT], 148, 2
[INSERT], 149, 1
[INSERT], 150, 0
[INSERT], 151, 3
[INSERT], 152, 0
[INSERT], 153, 0
[INSERT], 154, 3
[INSERT], 155, 1
[INSERT], 156, 0
[INSERT], 157, 2
[INSERT], 158, 1
[INSERT], 159, 1
[INSERT], 160, 1
[INSERT], 161, 2
[INSERT], 162, 2
[INSERT], 163, 4
[INSERT], 164, 2
[INSERT], 165, 2
[INSERT], 166, 3
[INSERT], 167, 1
[INSERT], 168, 2
[INSERT], 169, 3
[INSERT], 170, 0
[INSERT], 171, 1
[INSERT], 172, 1
[INSERT], 173, 3
[INSERT], 174, 0
[INSERT], 175, 2
[INSERT], 176, 2
[INSERT], 177, 2
[INSERT], 178, 2
[INSERT], 179, 4
[INSERT], 180, 2
[INSERT], 181, 3
[INSERT], 182, 1
[INSERT], 183, 4
[INSERT], 184, 0
[INSERT], 185, 1
[INSERT], 186, 1
[INSERT], 187, 1
[INSERT], 188, 1
[INSERT], 189, 2
[INSERT], 190, 1
[INSERT], 191, 0
[INSERT], 192, 2
[INSERT], 193, 0
[INSERT], 194, 3
[INSERT], 195, 0
[INSERT], 196, 2
[INSERT], 197, 2
[INSERT], 198, 0
[INSERT], 199, 0
[INSERT], 200, 1
[INSERT], 201, 0
[INSERT], 202, 1
[INSERT], 203, 0
[INSERT], 204, 0
[INSERT], 205, 2
[INSERT], 206, 0
[INSERT], 207, 0
[INSERT], 208, 0
[INSERT], 209, 0
[INSERT], 210, 1
[INSERT], 211, 1
[INSERT], 212, 2
[INSERT], 213, 1
[INSERT], 214, 1
[INSERT], 215, 1
[INSERT], 216, 1
[INSERT], 217, 0
[INSERT], 218, 1
[INSERT], 219, 0
[INSERT], 220, 1
[INSERT], 221, 1
[INSERT], 222, 0
[INSERT], 223, 1
[INSERT], 224, 0
[INSERT], 225, 4
[INSERT], 226, 3
[INSERT], 227, 0
[INSERT], 228, 2
[INSERT], 229, 1
[INSERT], 230, 0
[INSERT], 231, 3
[INSERT], 232, 3
[INSERT], 233, 0
[INSERT], 234, 1
[INSERT], 235, 2
[INSERT], 236, 5
[INSERT], 237, 2
[INSERT], 238, 1
[INSERT], 239, 6
[INSERT], 240, 0
[INSERT], 241, 0
[INSERT], 242, 0
[INSERT], 243, 1
[INSERT], 244, 4
[INSERT], 245, 6
[INSERT], 246, 5
[INSERT], 247, 0
[INSERT], 248, 1
[INSERT], 249, 2
[INSERT], 250, 0
[INSERT], 251, 0
[INSERT], 252, 0
[INSERT], 253, 1
[INSERT], 254, 0
[INSERT], 255, 0
[INSERT], 256, 1
[INSERT], 257, 1
[INSERT], 258, 1
[INSERT], 259, 2
[INSERT], 260, 1
[INSERT], 261, 2
[INSERT], 262, 0
[INSERT], 263, 0
[INSERT], 264, 0
[INSERT], 265, 2
[INSERT], 266, 0
[INSERT], 267, 0
[INSERT], 268, 2
[INSERT], 269, 0
[INSERT], 270, 0
[INSERT], 271, 3
[INSERT], 272, 0
[INSERT], 273, 0
[INSERT], 274, 0
[INSERT], 275, 2
[INSERT], 276, 0
[INSERT], 277, 2
[INSERT], 278, 1
[INSERT], 279, 1
[INSERT], 280, 1
[INSERT], 281, 0
[INSERT], 282, 1
[INSERT], 283, 0
[INSERT], 284, 0
[INSERT], 285, 0
[INSERT], 286, 1
[INSERT], 287, 1
[INSERT], 288, 2
[INSERT], 289, 0
[INSERT], 290, 0
[INSERT], 291, 1
[INSERT], 292, 0
[INSERT], 293, 0
[INSERT], 294, 1
[INSERT], 295, 0
[INSERT], 296, 0
[INSERT], 297, 0
[INSERT], 298, 1
[INSERT], 299, 1
[INSERT], 300, 4
[INSERT], 301, 1
[INSERT], 302, 0
[INSERT], 303, 0
[INSERT], 304, 1
[INSERT], 305, 2
[INSERT], 306, 0
[INSERT], 307, 0
[INSERT], 308, 0
[INSERT], 309, 0
[INSERT], 310, 2
[INSERT], 311, 0
[INSERT], 312, 1
[INSERT], 313, 0
[INSERT], 314, 0
[INSERT], 315, 2
[INSERT], 316, 0
[INSERT], 317, 0
[INSERT], 318, 2
[INSERT], 319, 1
[INSERT], 320, 2
[INSERT], 321, 0
[INSERT], 322, 1
[INSERT], 323, 0
[INSERT], 324, 1
[INSERT], 325, 0
[INSERT], 326, 1
[INSERT], 327, 0
[INSERT], 328, 0
[INSERT], 329, 1
[INSERT], 330, 0
[INSERT], 331, 2
[INSERT], 332, 1
[INSERT], 333, 0
[INSERT], 334, 1
[INSERT], 335, 0
[INSERT], 336, 1
[INSERT], 337, 0
[INSERT], 338, 0
[INSERT], 339, 2
[INSERT], 340, 2
[INSERT], 341, 0
[INSERT], 342, 2
[INSERT], 343, 2
[INSERT], 344, 2
[INSERT], 345, 0
[INSERT], 346, 1
[INSERT], 347, 1
[INSERT], 348, 1
[INSERT], 349, 1
[INSERT], 350, 2
[INSERT], 351, 1
[INSERT], 352, 0
[INSERT], 353, 0
[INSERT], 354, 0
[INSERT], 355, 1
[INSERT], 356, 3
[INSERT], 357, 0
[INSERT], 358, 0
[INSERT], 359, 1
[INSERT], 360, 0
[INSERT], 361, 0
[INSERT], 362, 0
[INSERT], 363, 1
[INSERT], 364, 0
[INSERT], 365, 1
[INSERT], 366, 1
[INSERT], 367, 0
[INSERT], 368, 1
[INSERT], 369, 0
[INSERT], 370, 1
[INSERT], 371, 1
[INSERT], 372, 3
[INSERT], 373, 0
[INSERT], 374, 0
[INSERT], 375, 3
[INSERT], 376, 1
[INSERT], 377, 1
[INSERT], 378, 2
[INSERT], 379, 3
[INSERT], 380, 1
[INSERT], 381, 3
[INSERT], 382, 2
[INSERT], 383, 0
[INSERT], 384, 3
[INSERT], 385, 4
[INSERT], 386, 3
[INSERT], 387, 3
[INSERT], 388, 3
[INSERT], 389, 2
[INSERT], 390, 4
[INSERT], 391, 3
[INSERT], 392, 4
[INSERT], 393, 1
[INSERT], 394, 2
[INSERT], 395, 3
[INSERT], 396, 1
[INSERT], 397, 1
[INSERT], 398, 2
[INSERT], 399, 3
[INSERT], 400, 2
[INSERT], 401, 1
[INSERT], 402, 4
[INSERT], 403, 2
[INSERT], 404, 4
[INSERT], 405, 3
[INSERT], 406, 3
[INSERT], 407, 2
[INSERT], 408, 3
[INSERT], 409, 4
[INSERT], 410, 0
[INSERT], 411, 4
[INSERT], 412, 2
[INSERT], 413, 3
[INSERT], 414, 2
[INSERT], 415, 4
[INSERT], 416, 0
[INSERT], 417, 1
[INSERT], 418, 1
[INSERT], 419, 4
[INSERT], 420, 2
[INSERT], 421, 2
[INSERT], 422, 0
[INSERT], 423, 1
[INSERT], 424, 2
[INSERT], 425, 2
[INSERT], 426, 3
[INSERT], 427, 2
[INSERT], 428, 4
[INSERT], 429, 3
[INSERT], 430, 0
[INSERT], 431, 1
[INSERT], 432, 0
[INSERT], 433, 0
[INSERT], 434, 1
[INSERT], 435, 2
[INSERT], 436, 2
[INSERT], 437, 0
[INSERT], 438, 6
[INSERT], 439, 2
[INSERT], 440, 1
[INSERT], 441, 2
[INSERT], 442, 4
[INSERT], 443, 1
[INSERT], 444, 2
[INSERT], 445, 0
[INSERT], 446, 4
[INSERT], 447, 1
[INSERT], 448, 1
[INSERT], 449, 2
[INSERT], 450, 1
[INSERT], 451, 2
[INSERT], 452, 3
[INSERT], 453, 5
[INSERT], 454, 6
[INSERT], 455, 4
[INSERT], 456, 10
[INSERT], 457, 7
[INSERT], 458, 11
[INSERT], 459, 7
[INSERT], 460, 10
[INSERT], 461, 4
[INSERT], 462, 7
[INSERT], 463, 4
[INSERT], 464, 2
[INSERT], 465, 4
[INSERT], 466, 3
[INSERT], 467, 2
[INSERT], 468, 6
[INSERT], 469, 7
[INSERT], 470, 7
[INSERT], 471, 3
[INSERT], 472, 9
[INSERT], 473, 5
[INSERT], 474, 2
[INSERT], 475, 5
[INSERT], 476, 2
[INSERT], 477, 1
[INSERT], 478, 2
[INSERT], 479, 1
[INSERT], 480, 3
[INSERT], 481, 1
[INSERT], 482, 1
[INSERT], 483, 1
[INSERT], 484, 0
[INSERT], 485, 0
[INSERT], 486, 0
[INSERT], 487, 0
[INSERT], 488, 1
[INSERT], 489, 0
[INSERT], 490, 0
[INSERT], 491, 0
[INSERT], 492, 1
[INSERT], 493, 0
[INSERT], 494, 0
[INSERT], 495, 0
[INSERT], 496, 0
[INSERT], 497, 1
[INSERT], 498, 1
[INSERT], 499, 1
[INSERT], 500, 0
[INSERT], 501, 1
[INSERT], 502, 0
[INSERT], 503, 0
[INSERT], 504, 0
[INSERT], 505, 0
[INSERT], 506, 0
[INSERT], 507, 0
[INSERT], 508, 0
[INSERT], 509, 1
[INSERT], 510, 0
[INSERT], 511, 1
[INSERT], 512, 0
[INSERT], 513, 0
[INSERT], 514, 0
[INSERT], 515, 0
[INSERT], 516, 1
[INSERT], 517, 0
[INSERT], 518, 0
[INSERT], 519, 0
[INSERT], 520, 1
[INSERT], 521, 1
[INSERT], 522, 0
[INSERT], 523, 0
[INSERT], 524, 1
[INSERT], 525, 1
[INSERT], 526, 1
[INSERT], 527, 0
[INSERT], 528, 0
[INSERT], 529, 0
[INSERT], 530, 0
[INSERT], 531, 0
[INSERT], 532, 0
[INSERT], 533, 1
[INSERT], 534, 1
[INSERT], 535, 2
[INSERT], 536, 0
[INSERT], 537, 0
[INSERT], 538, 3
[INSERT], 539, 1
[INSERT], 540, 1
[INSERT], 541, 0
[INSERT], 542, 0
[INSERT], 543, 0
[INSERT], 544, 0
[INSERT], 545, 0
[INSERT], 546, 1
[INSERT], 547, 2
[INSERT], 548, 0
[INSERT], 549, 0
[INSERT], 550, 2
[INSERT], 551, 0
[INSERT], 552, 0
[INSERT], 553, 1
[INSERT], 554, 0
[INSERT], 555, 0
[INSERT], 556, 1
[INSERT], 557, 0
[INSERT], 558, 0
[INSERT], 559, 0
[INSERT], 560, 2
[INSERT], 561, 2
[INSERT], 562, 1
[INSERT], 563, 2
[INSERT], 564, 4
[INSERT], 565, 1
[INSERT], 566, 7
[INSERT], 567, 6
[INSERT], 568, 7
[INSERT], 569, 7
[INSERT], 570, 7
[INSERT], 571, 3
[INSERT], 572, 7
[INSERT], 573, 9
[INSERT], 574, 2
[INSERT], 575, 4
[INSERT], 576, 2
[INSERT], 577, 3
[INSERT], 578, 3
[INSERT], 579, 0
[INSERT], 580, 2
[INSERT], 581, 2
[INSERT], 582, 1
[INSERT], 583, 3
[INSERT], 584, 2
[INSERT], 585, 2
[INSERT], 586, 0
[INSERT], 587, 0
[INSERT], 588, 0
[INSERT], 589, 3
[INSERT], 590, 2
[INSERT], 591, 0
[INSERT], 592, 1
[INSERT], 593, 1
[INSERT], 594, 0
[INSERT], 595, 2
[INSERT], 596, 4
[INSERT], 597, 2
[INSERT], 598, 4
[INSERT], 599, 0
[INSERT], 600, 2
[INSERT], 601, 0
[INSERT], 602, 0
[INSERT], 603, 1
[INSERT], 604, 1
[INSERT], 605, 1
[INSERT], 606, 1
[INSERT], 607, 2
[INSERT], 608, 0
[INSERT], 609, 0
[INSERT], 610, 1
[INSERT], 611, 0
[INSERT], 612, 1
[INSERT], 613, 3
[INSERT], 614, 2
[INSERT], 615, 1
[INSERT], 616, 2
[INSERT], 617, 0
[INSERT], 618, 1
[INSERT], 619, 1
[INSERT], 620, 1
[INSERT], 621, 1
[INSERT], 622, 0
[INSERT], 623, 1
[INSERT], 624, 0
[INSERT], 625, 1
[INSERT], 626, 0
[INSERT], 627, 0
[INSERT], 628, 2
[INSERT], 629, 1
[INSERT], 630, 0
[INSERT], 631, 1
[INSERT], 632, 0
[INSERT], 633, 1
[INSERT], 634, 0
[INSERT], 635, 1
[INSERT], 636, 2
[INSERT], 637, 2
[INSERT], 638, 4
[INSERT], 639, 6
[INSERT], 640, 3
[INSERT], 641, 3
[INSERT], 642, 2
[INSERT], 643, 5
[INSERT], 644, 6
[INSERT], 645, 6
[INSERT], 646, 6
[INSERT], 647, 6
[INSERT], 648, 2
[INSERT], 649, 0
[INSERT], 650, 0
[INSERT], 651, 1
[INSERT], 652, 0
[INSERT], 653, 1
[INSERT], 654, 0
[INSERT], 655, 0
[INSERT], 656, 0
[INSERT], 657, 0
[INSERT], 658, 0
[INSERT], 659, 0
[INSERT], 660, 0
[INSERT], 661, 0
[INSERT], 662, 0
[INSERT], 663, 0
[INSERT], 664, 1
[INSERT], 665, 1
[INSERT], 666, 0
[INSERT], 667, 0
[INSERT], 668, 0
[INSERT], 669, 0
[INSERT], 670, 1
[INSERT], 671, 0
[INSERT], 672, 0
[INSERT], 673, 0
[INSERT], 674, 1
[INSERT], 675, 0
[INSERT], 676, 0
[INSERT], 677, 0
[INSERT], 678, 0
[INSERT], 679, 0
[INSERT], 680, 1
[INSERT], 681, 0
[INSERT], 682, 0
[INSERT], 683, 0
[INSERT], 684, 0
[INSERT], 685, 1
[INSERT], 686, 0
[INSERT], 687, 0
[INSERT], 688, 0
[INSERT], 689, 0
[INSERT], 690, 0
[INSERT], 691, 0
[INSERT], 692, 1
[INSERT], 693, 0
[INSERT], 694, 0
[INSERT], 695, 0
[INSERT], 696, 0
[INSERT], 697, 0
[INSERT], 698, 0
[INSERT], 699, 0
[INSERT], 700, 1
[INSERT], 701, 0
[INSERT], 702, 0
[INSERT], 703, 0
[INSERT], 704, 2
[INSERT], 705, 0
[INSERT], 706, 0
[INSERT], 707, 1
[INSERT], 708, 0
[INSERT], 709, 0
[INSERT], 710, 0
[INSERT], 711, 0
[INSERT], 712, 0
[INSERT], 713, 0
[INSERT], 714, 1
[INSERT], 715, 0
[INSERT], 716, 0
[INSERT], 717, 0
[INSERT], 718, 0
[INSERT], 719, 0
[INSERT], 720, 2
[INSERT], 721, 0
[INSERT], 722, 0
[INSERT], 723, 0
[INSERT], 724, 0
[INSERT], 725, 0
[INSERT], 726, 1
[INSERT], 727, 0
[INSERT], 728, 1
[INSERT], 729, 0
[INSERT], 730, 0
[INSERT], 731, 1
[INSERT], 732, 1
[INSERT], 733, 0
[INSERT], 734, 0
[INSERT], 735, 0
[INSERT], 736, 0
[INSERT], 737, 0
[INSERT], 738, 0
[INSERT], 739, 1
[INSERT], 740, 0
[INSERT], 741, 0
[INSERT], 742, 0
[INSERT], 743, 0
[INSERT], 744, 0
[INSERT], 745, 0
[INSERT], 746, 0
[INSERT], 747, 1
[INSERT], 748, 0
[INSERT], 749, 0
[INSERT], 750, 0
[INSERT], 751, 0
[INSERT], 752, 1
[INSERT], 753, 0
[INSERT], 754, 0
[INSERT], 755, 0
[INSERT], 756, 0
[INSERT], 757, 0
[INSERT], 758, 0
[INSERT], 759, 0
[INSERT], 760, 0
[INSERT], 761, 0
[INSERT], 762, 1
[INSERT], 763, 0
[INSERT], 764, 0
[INSERT], 765, 0
[INSERT], 766, 1
[INSERT], 767, 0
[INSERT], 768, 0
[INSERT], 769, 0
[INSERT], 770, 0
[INSERT], 771, 0
[INSERT], 772, 1
[INSERT], 773, 0
[INSERT], 774, 0
[INSERT], 775, 0
[INSERT], 776, 1
[INSERT], 777, 0
[INSERT], 778, 0
[INSERT], 779, 0
[INSERT], 780, 0
[INSERT], 781, 0
[INSERT], 782, 1
[INSERT], 783, 0
[INSERT], 784, 1
[INSERT], 785, 0
[INSERT], 786, 1
[INSERT], 787, 1
[INSERT], 788, 0
[INSERT], 789, 2
[INSERT], 790, 2
[INSERT], 791, 2
[INSERT], 792, 2
[INSERT], 793, 2
[INSERT], 794, 4
[INSERT], 795, 2
[INSERT], 796, 1
[INSERT], 797, 1
[INSERT], 798, 4
[INSERT], 799, 3
[INSERT], 800, 5
[INSERT], 801, 2
[INSERT], 802, 2
[INSERT], 803, 2
[INSERT], 804, 5
[INSERT], 805, 2
[INSERT], 806, 1
[INSERT], 807, 2
[INSERT], 808, 1
[INSERT], 809, 3
[INSERT], 810, 3
[INSERT], 811, 0
[INSERT], 812, 3
[INSERT], 813, 2
[INSERT], 814, 3
[INSERT], 815, 1
[INSERT], 816, 3
[INSERT], 817, 1
[INSERT], 818, 1
[INSERT], 819, 0
[INSERT], 820, 0
[INSERT], 821, 3
[INSERT], 822, 1
[INSERT], 823, 2
[INSERT], 824, 3
[INSERT], 825, 4
[INSERT], 826, 2
[INSERT], 827, 2
[INSERT], 828, 4
[INSERT], 829, 1
[INSERT], 830, 1
[INSERT], 831, 0
[INSERT], 832, 2
[INSERT], 833, 3
[INSERT], 834, 6
[INSERT], 835, 1
[INSERT], 836, 0
[INSERT], 837, 2
[INSERT], 838, 2
[INSERT], 839, 0
[INSERT], 840, 1
[INSERT], 841, 0
[INSERT], 842, 2
[INSERT], 843, 0
[INSERT], 844, 2
[INSERT], 845, 1
[INSERT], 846, 2
[INSERT], 847, 0
[INSERT], 848, 0
[INSERT], 849, 0
[INSERT], 850, 0
[INSERT], 851, 0
[INSERT], 852, 0
[INSERT], 853, 0
[INSERT], 854, 0
[INSERT], 855, 0
[INSERT], 856, 0
[INSERT], 857, 0
[INSERT], 858, 0
[INSERT], 859, 1
[INSERT], 860, 0
[INSERT], 861, 0
[INSERT], 862, 3
[INSERT], 863, 1
[INSERT], 864, 1
[INSERT], 865, 1
[INSERT], 866, 0
[INSERT], 867, 0
[INSERT], 868, 1
[INSERT], 869, 1
[INSERT], 870, 0
[INSERT], 871, 0
[INSERT], 872, 0
[INSERT], 873, 0
[INSERT], 874, 1
[INSERT], 875, 0
[INSERT], 876, 0
[INSERT], 877, 0
[INSERT], 878, 0
[INSERT], 879, 0
[INSERT], 880, 0
[INSERT], 881, 0
[INSERT], 882, 0
[INSERT], 883, 1
[INSERT], 884, 0
[INSERT], 885, 0
[INSERT], 886, 0
[INSERT], 887, 1
[INSERT], 888, 0
[INSERT], 889, 0
[INSERT], 890, 0
[INSERT], 891, 0
[INSERT], 892, 0
[INSERT], 893, 0
[INSERT], 894, 0
[INSERT], 895, 0
[INSERT], 896, 1
[INSERT], 897, 0
[INSERT], 898, 1
[INSERT], 899, 0
[INSERT], 900, 0
[INSERT], 901, 0
[INSERT], 902, 0
[INSERT], 903, 0
[INSERT], 904, 0
[INSERT], 905, 0
[INSERT], 906, 1
[INSERT], 907, 0
[INSERT], 908, 1
[INSERT], 909, 0
[INSERT], 910, 0
[INSERT], 911, 0
[INSERT], 912, 0
[INSERT], 913, 0
[INSERT], 914, 0
[INSERT], 915, 0
[INSERT], 916, 0
[INSERT], 917, 0
[INSERT], 918, 1
[INSERT], 919, 0
[INSERT], 920, 0
[INSERT], 921, 0
[INSERT], 922, 0
[INSERT], 923, 0
[INSERT], 924, 0
[INSERT], 925, 0
[INSERT], 926, 0
[INSERT], 927, 0
[INSERT], 928, 1
[INSERT], 929, 0
[INSERT], 930, 0
[INSERT], 931, 1
[INSERT], 932, 1
[INSERT], 933, 0
[INSERT], 934, 0
[INSERT], 935, 0
[INSERT], 936, 0
[INSERT], 937, 0
[INSERT], 938, 0
[INSERT], 939, 0
[INSERT], 940, 0
[INSERT], 941, 0
[INSERT], 942, 0
[INSERT], 943, 0
[INSERT], 944, 0
[INSERT], 945, 0
[INSERT], 946, 0
[INSERT], 947, 0
[INSERT], 948, 0
[INSERT], 949, 0
[INSERT], 950, 0
[INSERT], 951, 0
[INSERT], 952, 1
[INSERT], 953, 0
[INSERT], 954, 1
[INSERT], 955, 0
[INSERT], 956, 1
[INSERT], 957, 0
[INSERT], 958, 0
[INSERT], 959, 0
[INSERT], 960, 0
[INSERT], 961, 1
[INSERT], 962, 0
[INSERT], 963, 0
[INSERT], 964, 0
[INSERT], 965, 0
[INSERT], 966, 0
[INSERT], 967, 0
[INSERT], 968, 0
[INSERT], 969, 0
[INSERT], 970, 1
[INSERT], 971, 1
[INSERT], 972, 0
[INSERT], 973, 1
[INSERT], 974, 2
[INSERT], 975, 3
[INSERT], 976, 4
[INSERT], 977, 3
[INSERT], 978, 3
[INSERT], 979, 2
[INSERT], 980, 3
[INSERT], 981, 2
[INSERT], 982, 2
[INSERT], 983, 0
[INSERT], 984, 2
[INSERT], 985, 2
[INSERT], 986, 3
[INSERT], 987, 0
[INSERT], 988, 1
[INSERT], 989, 3
[INSERT], 990, 2
[INSERT], 991, 2
[INSERT], 992, 0
[INSERT], 993, 0
[INSERT], 994, 3
[INSERT], 995, 2
[INSERT], 996, 1
[INSERT], 997, 3
[INSERT], 998, 2
[INSERT], 999, 4
[INSERT], >1000, 648
java -cp /home/michim/gitdev/YCSB/core/target/core-0.1.4.jar:/home/michim/gitdev/YCSB/infinispan/src/main/conf:/home/michim/gitdev/YCSB/hbase/src/main/conf:/home/michim/gitdev/YCSB/jdbc/src/main/conf:/home/michim/gitdev/YCSB/nosqldb/src/main/conf:/home/michim/gitdev/YCSB/mapkeeper/target/mapkeeper-binding-0.1.4.jar:/home/michim/gitdev/YCSB/mapkeeper/target/archive-tmp/mapkeeper-binding-0.1.4.jar:/home/michim/gitdev/YCSB/gemfire/src/main/conf:/home/michim/gitdev/YCSB/voldemort/src/main/conf com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MapKeeperClient -P workloads/workloada -p mapkeeper.host=dqa-config2-006.dht.bf1.yahoo.com -p mapkeeper.port=9090 -s -threads 5000 -load